---
kind: method
id: M:Autodesk.Revit.DB.Analysis.MEPNetworkSegmentData.GetDownstreamSegments
source: html/4c3a42e2-2aa9-b984-e70f-4f05ad2c8453.htm
---
# Autodesk.Revit.DB.Analysis.MEPNetworkSegmentData.GetDownstreamSegments Method

Gets all downstream network segments.

## Syntax (C#)
```csharp
public IList<MEPNetworkSegmentId> GetDownstreamSegments()
```

## Returns
The list of segments that flow out of this segment.